chanchen1988/testa/esp32c61/at_device_esp32c61.c
    /* connect to WiFi AP */
    if (at_obj_exec_cmd(client, at_resp_set_info(resp, 512, 0, 20 * RT_TICK_PER_SECOND),
                        "AT+CWJAP=\"%s\",\"%s\"", esp32c61->wifi_ssid, esp32c61->wifi_password) != RT_EOK)
    {
        LOG_W("%s device wifi connect failed, check ssid(%s) and password(%s).",
              device->name, esp32c61->wifi_ssid, esp32c61->wifi_password);
    }
    else
    {
        wifi_is_conn = RT_TRUE;
    }

    if (resp)
    {
        at_delete_resp(resp);
    }

    if (result != RT_EOK)
    {
        netdev_low_level_set_status(device->netdev, RT_FALSE);
        LOG_E("%s device network initialize failed(%d).", device->name, result);
    }
    else
    {
        device->is_init = RT_TRUE;
        netdev_low_level_set_status(device->netdev, RT_TRUE);
        if (wifi_is_conn)
        {
            netdev_low_level_set_link_status(device->netdev, RT_TRUE);
        }
        esp32c61_netdev_start_delay_work(device);
        LOG_I("%s device network initialize successfully.", device->name);
    }
}

static int esp32c61_net_init(struct at_device *device)
{
#ifdef AT_DEVICE_ESP32C61_INIT_ASYN
    rt_thread_t tid;

    tid = rt_thread_create("esp61_net", esp32c61_init_thread_entry, (void *) device,
            ESP32C61_THREAD_STACK_SIZE, ESP32C61_THREAD_PRIORITY, 20);
    if (tid)
    {
        rt_thread_startup(tid);
    }
    else
    {
        LOG_E("create %s device init thread failed.", device->name);
        return -RT_ERROR;
    }
#else
    esp32c61_init_thread_entry(device);
#endif /* AT_DEVICE_ESP32C61_INIT_ASYN */

    return RT_EOK;
}

static void urc_busy_p_func(struct at_client *client, const char *data, rt_size_t size)
{
    LOG_D("system is processing a commands...");
}

static void urc_busy_s_func(struct at_client *client, const char *data, rt_size_t size)
{
    LOG_D("system is sending data...");
}

static void urc_func(struct at_client *client, const char *data, rt_size_t size)
{
    struct at_device *device = RT_NULL;

    RT_ASSERT(client && data && size);
    char *client_name = client->device->parent.name;

    device = at_device_get_by_name(AT_DEVICE_NAMETYPE_CLIENT, client_name);
    if (device == RT_NULL)
    {
        LOG_E("get device(%s) failed.", client_name);
        return;
    }

    if (rt_strstr(data, "WIFI CONNECTED"))
    {
        LOG_I("%s device wifi is connected.", device->name);

        if (device->is_init)
        {
            netdev_low_level_set_link_status(device->netdev, RT_TRUE);

            esp32c61_netdev_start_delay_work(device);
        }
    }
    else if (rt_strstr(data, "WIFI DISCONNECT"))
    {
        LOG_I("%s device wifi is disconnect.", device->name);

        if (device->is_init)
        {
            netdev_low_level_set_link_status(device->netdev, RT_FALSE);
        }
    }
}

static const struct at_urc urc_table[] =
{
    {"busy p",           "\r\n",           urc_busy_p_func},
    {"busy s",           "\r\n",           urc_busy_s_func},
    {"WIFI CONNECTED",   "\r\n",           urc_func},
    {"WIFI DISCONNECT",  "\r\n",           urc_func},
};

static int esp32c61_init(struct at_device *device)
{
    struct at_device_esp32c61 *esp32c61 = rt_container_of(device, struct at_device_esp32c61, device);

    /* initialize AT client */
#if RT_VER_NUM >= 0x50100
    at_client_init(esp32c61->client_name, esp32c61->recv_line_num, esp32c61->recv_line_num);
#else
    at_client_init(esp32c61->client_name, esp32c61->recv_line_num);
#endif

    device->client = at_client_get(esp32c61->client_name);
    if (device->client == RT_NULL)
    {
        LOG_E("get AT client(%s) failed.", esp32c61->client_name);
        return -RT_ERROR;
    }

    /* register URC data execution function  */
    at_obj_set_urc_table(device->client, urc_table, sizeof(urc_table) / sizeof(urc_table[0]));

#ifdef AT_USING_SOCKET
    esp32c61_socket_init(device);
#endif

    /* add esp32c61 device to the netdev list */
    device->netdev = esp32c61_netdev_add(esp32c61->device_name);
    if (device->netdev == RT_NULL)
    {
        LOG_E("add netdev(%s) failed.", esp32c61->device_name);
        return -RT_ERROR;
    }

    /* initialize esp32c61 device network */
    return esp32c61_netdev_set_up(device->netdev);
}

static int esp32c61_deinit(struct at_device *device)
{
    return esp32c61_netdev_set_down(device->netdev);
}
/**
 * Set the host name of the ESP32C61 device.
 *
 * @param device    Pointer to the AT device structure.
 * @param host_name Host name string to set for the ESP32C61 device.
 *
 * @return RT_EOK on success, -RT_ERROR on failure.
 */
static int esp32c61_set_host_name(struct at_device *device, const char *host_name)
{
    int result = RT_EOK;
    struct at_client *client = device->client;
    if (host_name == RT_NULL || device->is_init == RT_FALSE)
    {
        return -RT_ERROR;
    }
    result = at_obj_exec_cmd(client, RT_NULL, "AT+CWHOSTNAME=\"%s\"", host_name);
    return result;
}

/* reset esp32c61 device and initialize device network again */
static int esp32c61_reset(struct at_device *device)
{
    int result = RT_EOK;
    struct at_client *client = device->client;

    /* send "AT+RST" commonds to esp32c61 device */
    result = at_obj_exec_cmd(client, RT_NULL, "AT+RST");
    rt_thread_mdelay(1000);

    /* waiting 10 seconds for esp32c61 device reset */
    device->is_init = RT_FALSE;
    if (at_client_obj_wait_connect(client, ESP32C61_WAIT_CONNECT_TIME))
    {
        return -RT_ETIMEOUT;
    }

    /* initialize esp32c61 device network */
    esp32c61_net_init(device);

    device->is_init = RT_TRUE;

    return result;
}

/* change esp32c61 wifi ssid and password information */
static int esp32c61_wifi_info_set(struct at_device *device, struct at_device_ssid_pwd *info)
{
    int result = RT_EOK;
    struct at_response *resp = RT_NULL;

    if (info->ssid == RT_NULL || info->password == RT_NULL)
    {
        LOG_E("input wifi ssid(%s) and password(%s) error.", info->ssid, info->password);
        return -RT_ERROR;
    }

    resp = at_create_resp(128, 0, 20 * RT_TICK_PER_SECOND);
    if (resp == RT_NULL)
    {
        LOG_E("no memory for resp create.");
        return -RT_ENOMEM;
    }

    /* connect to input wifi ap */
    if (at_obj_exec_cmd(device->client, resp, "AT+CWJAP=\"%s\",\"%s\"", info->ssid, info->password) != RT_EOK)
    {
        LOG_E("%s device wifi connect failed, check ssid(%s) and password(%s).",
              device->name, info->ssid, info->password);
        result = -RT_ERROR;
    }

    if (resp)
    {
        at_delete_resp(resp);
    }

    return result;
}

static int esp32c61_control(struct at_device *device, int cmd, void *arg)
{
    int result = -RT_ERROR;

