chanchen1988/testa/esp32c61/at_device_esp32c61.c
    RT_ASSERT(device);

    switch (cmd)
    {
    case AT_DEVICE_CTRL_POWER_ON:
    case AT_DEVICE_CTRL_POWER_OFF:
    case AT_DEVICE_CTRL_LOW_POWER:
    case AT_DEVICE_CTRL_SLEEP:
    case AT_DEVICE_CTRL_WAKEUP:
    case AT_DEVICE_CTRL_NET_CONN:
    case AT_DEVICE_CTRL_NET_DISCONN:
    case AT_DEVICE_CTRL_GET_SIGNAL:
    case AT_DEVICE_CTRL_GET_GPS:
    case AT_DEVICE_CTRL_GET_VER:
        LOG_W("not support the control cmd(%d).", cmd);
        break;
    case AT_DEVICE_CTRL_RESET:
        result = esp32c61_reset(device);
        break;
    case AT_DEVICE_CTRL_SET_WIFI_INFO:
        result = esp32c61_wifi_info_set(device, (struct at_device_ssid_pwd *) arg);
        break;
    case AT_DEVICE_CTRL_SET_HOST_NAME:
        result = esp32c61_set_host_name(device, (const char *)arg);
        break;
    default:
        LOG_E("input error control cmd(%d).", cmd);
        break;
    }

    return result;
}

static const struct at_device_ops esp32c61_device_ops =
{
    esp32c61_init,
    esp32c61_deinit,
    esp32c61_control,
};

static int esp32c61_device_class_register(void)
{
    struct at_device_class *class = RT_NULL;

    class = (struct at_device_class *) rt_calloc(1, sizeof(struct at_device_class));
    if (class == RT_NULL)
    {
        LOG_E("no memory for class create.");
        return -RT_ENOMEM;
    }

    /* fill ESP32C61 device class object */
#ifdef AT_USING_SOCKET
    esp32c61_socket_class_register(class);
#endif
    class->device_ops = &esp32c61_device_ops;

    return at_device_class_register(class, AT_DEVICE_CLASS_ESP32C61);
}
INIT_DEVICE_EXPORT(esp32c61_device_class_register);

/**
 * Convert the ESP32C61 AT version string to hexadecimal
 *
 * @param string containing the AT version
 *
 * @return hex_number: Hexadecimal AT version number, example: 1.4.1.1 -> 0x1040101
 */
unsigned int esp32c61_at_version_to_hex(const char *str)
{
    const char *version_prefix = "AT version:";
    char *version_start;
    unsigned int numbers[4];
    unsigned int hex_number;

    if (str == NULL || *str == '\0')
    {
        LOG_E("Invalid AT version format\n");
        return 0;
    }

    /* Get AT version string */
    version_start = strstr(str, version_prefix);
    if (version_start)
    {
        if (rt_sscanf(version_start, "AT version:%d.%d.%d.%d", &numbers[0], &numbers[1], &numbers[2], &numbers[3]) == 4)
        {
            hex_number = (numbers[0] << 24) | (numbers[1] << 16) | (numbers[2] << 8) | numbers[3];
        }
        else
        {
            LOG_W("The AT instruction format is not standard\n");
            return 0;
        }
    }
    else
    {
        LOG_W("The AT+GMR instruction is not supported\n");
        return 0;
    }

    return hex_number;
}

/**
 * This function is used to obtain the ESP32C61 AT version number.
 *
 * @return hex_number: Hexadecimal AT version number, example: 1.4.1.1 -> 0x1040101
 */
unsigned int esp32c61_get_at_version(void)
{
    return ESP32C61_GMR_AT_VERSION;
}
int esp32c61_scan_ap(struct at_device *device, at_ap_info_t *ap_info, uint8_t num)
{

    int result = RT_EOK;
    struct at_client *client = device->client;
    struct at_response *resp = RT_NULL;
    uint8_t ap_count = 0;

    RT_ASSERT(device && ap_info && num);

    resp = at_create_resp(2048, 0, 20 * RT_TICK_PER_SECOND);
    if (resp == RT_NULL)
    {
        LOG_E("no memory for resp create.");
        return 0;
    }

    if (at_obj_exec_cmd(client, resp, "AT+CWLAP") < 0)
    {
        result = -RT_ERROR;
        goto __exit;
    }
    //+CWLAP:(3,"HONOR 20",-51,"22:a6:f3:40:da:3d",1)

    at_ap_info_t *ap_info_ptr;
    for (int i = 1; i <= resp->line_counts && ap_count < num; i++)
    {
        ap_info_ptr = &ap_info[ap_count];
        char mac[32];
        int temp_ecn, temp_rssi, temp_channel;
        if (at_resp_parse_line_args(resp, i,
                                    "%*[^(](%d,\"%31[^\"]\",%d,\"%31[^\"]\",%d)",
                                    &temp_ecn, ap_info_ptr->ssid, &temp_rssi,
                                    mac, &temp_channel) == 5)
        {
            ap_info_ptr->ecn = (uint8_t)temp_ecn;
            ap_info_ptr->rssi = (int8_t)temp_rssi;
            ap_info_ptr->channel = (uint8_t)temp_channel;
            rt_uint32_t mac_addr[6] = {0};
            rt_sscanf(mac, "%x:%x:%x:%x:%x:%x",
                      &mac_addr[0], &mac_addr[1], &mac_addr[2],
                      &mac_addr[3], &mac_addr[4], &mac_addr[5]);
            for (int j = 0; j < 6; j++)
            {
                ap_info_ptr->mac[j] = (uint8_t)mac_addr[j];
            }
            ap_count++;
        }
    }
__exit:

    if (resp)
    {
        at_delete_resp(resp);
    }
    if (result != RT_EOK)
    {
        return 0;
    }
    else
    {
        return ap_count;
    }
}
#endif /* AT_DEVICE_USING_ESP32C61 */